Tekla.Structures.TeklaStructuresSettings.InvalidPathCallback
The invalid path callback - provides error logging for GetAdvancedOptionPaths when a string is found to be invalid as a path
advancedOption: The advanced option name.
invalidString: The invalid string.
exceptionMessage: The exception message if an exception was thrown when converting the string to a path.